import { Link } from "react-router-dom";
import Button from "./Button";
import { FaPhoneAlt } from "react-icons/fa";
function About() {
  return (
    <div className="relative flex flex-col bg-[#fff]">
      <img
        src="/images/About/_8f764a88-c5e7-42b1-b611-9fa6d32b0635.jfif"
        alt="About.jpg"
        className="ipadpro:h-64"
      />
      <h1 className="absolute h-[200px] w-full content-center text-center font-vaziri text-3xl text-white">
        درباره گروه صنعتی قهوه سالامون
      </h1>
      <div className="animate-move-up relative -top-[40px] z-20 my-3 flex w-[70%] flex-col items-center gap-5 self-center">
        <div className="my-5 flex flex-col gap-5 rounded-2xl bg-[#fff] p-5 shadow-2xl">
          <h1 className="font-vaziri text-xl">در باره ما:</h1>
          <p className="text-lg">
            اینجا سالامون است، یک قرن خاطره با بوی قهوه در چهارراه استانبول
          </p>
          <p className="text-lg">
            از زمان تاسیس سالامون در سال 1311 هجری شمسی توسط یک بانوی ارمنی از
            اجداد ما، نزدیک به یک قرن است که افتخار همراهی با شما را داریم و
            بعنوان اولین تولید کننده قهوه در ایران به این همراهی می بالیم.
            بسیاری از مشتریان ما از زمان کودکی به همراه پدر و مادر یا بعضاً
            پدربزرگ و مادربزرگ خود برای خرید قهوه به فروشگاه ما آمده اند و امروز
            با مرور خاطراتشان در زمان خرید، شعف دوچندان به همکاران ما هدیه می
            دهند. در طول نود سال گذشته بسیاری از برندهای بزرگ ایرانی بدلیل
            ناملایمات پیش آمده در مسیر حرکت خود از بین رفته اند اما سالامون به
            پشتوانه همراهی شما استوار و پابرجاست و قدردان همراهیتان در طول 3 نسل
            گذشته است.
          </p>
          <p className="text-lg">
            مهمترین دلیل بقاء، ماندگاری و پیشرفت سالامون توجه به کیفیت و خواسته
            های شما و استفاده از ابزارهای روز برای تامین مناسب تر نیازهای
            مشتریان خود است. برای پاسخ دادن به نیازهای شما عزیزان و به پاس
            قدردانی از همراهی ارزشمندتان در این سالهای طولانی، تلاش کرده ایم تا
            هرآنچه برای نوشیدن قهوه نیاز دارید را با بهترین کیفیت و راحت ترین
            راه دسترسی ممکن برایتان فرآهم کنیم. به همین دلیل است که مرغوبترین
            نوع قهوه سبز (مواد اولیه قهوه) را از کشورهای تولید کننده تهیه می
            کنیم، با فرمول خاص سالامون در کارخانه فرآوری می کنیم و از طریق
            ابزارهای مختلف مانند سفارش تلفنی، فروشگاه اینترنتی یا فروش حضوری در
            اختیار شما قرار می دهیم تا به راحتی خرید کرده و طعم اصیل انواع قهوه
            را تجربه کنید.
          </p>
          <p className="text-lg">
            برای نوشیدن قهوه علاوه بر دانه یا پودر آن به ابزارهایی مانند وسایل
            دم آوری و نیز اطلاعات برای نحوه صحیح دم آوری نیاز دارید. این موضوع
            هم مد نظر داریم و به همین دلیل کاربردی ترین ابزارها را به همراه
            آموزش های لازم برایتان فرآهم کرده ایم تا به راحتی بتوانید در منزل یا
            محل کارتان مانند یک باریستای حرفه ای قهوه درست کنید و از نوشیدن آن
            به همراه عزیزانتان لذت ببرید.
          </p>
        </div>
      </div>{" "}
      <div className="mb-5 flex self-center">
        <Link to="/contact" >
          <Button type={"call"}>
            تماس با ما
            <FaPhoneAlt />
          </Button>
        </Link>
      </div>
    </div>
  );
}

export default About;
